Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cx_mtsh_db/src/packs/PIC32CX2051MTSH128_DFP/component/pwm.h
#define PWM_ISR2_CMPM_Pos                     _UINT32_(8)                                          /* (PWM_ISR2 Position) Comparison x Match */
#define PWM_ISR2_CMPM_Msk                     (_UINT32_(0xFF) << PWM_ISR2_CMPM_Pos)                /* (PWM_ISR2 Mask) CMPM */
#define PWM_ISR2_CMPM(value)                  (PWM_ISR2_CMPM_Msk & (_UINT32_(value) << PWM_ISR2_CMPM_Pos)) 
#define PWM_ISR2_CMPU_Pos                     _UINT32_(16)                                         /* (PWM_ISR2 Position) Comparison 7 Update */
#define PWM_ISR2_CMPU_Msk                     (_UINT32_(0xFF) << PWM_ISR2_CMPU_Pos)                /* (PWM_ISR2 Mask) CMPU */
#define PWM_ISR2_CMPU(value)                  (PWM_ISR2_CMPU_Msk & (_UINT32_(value) << PWM_ISR2_CMPU_Pos)) 

/* -------- PWM_OOV : (PWM Offset: 0x44) (R/W 32) PWM Output Override Value Register -------- */
#define PWM_OOV_OOVH0_Pos                     _UINT32_(0)                                          /* (PWM_OOV) Output Override Value for PWMH output of the channel 0 Position */
#define PWM_OOV_OOVH0_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVH0_Pos)                 /* (PWM_OOV) Output Override Value for PWMH output of the channel 0 Mask */
#define PWM_OOV_OOVH0(value)                  (PWM_OOV_OOVH0_Msk & (_UINT32_(value) << PWM_OOV_OOVH0_Pos)) /* Assigment of value for OOVH0 in the PWM_OOV register */
#define PWM_OOV_OOVH1_Pos                     _UINT32_(1)                                          /* (PWM_OOV) Output Override Value for PWMH output of the channel 1 Position */
#define PWM_OOV_OOVH1_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVH1_Pos)                 /* (PWM_OOV) Output Override Value for PWMH output of the channel 1 Mask */
#define PWM_OOV_OOVH1(value)                  (PWM_OOV_OOVH1_Msk & (_UINT32_(value) << PWM_OOV_OOVH1_Pos)) /* Assigment of value for OOVH1 in the PWM_OOV register */
#define PWM_OOV_OOVH2_Pos                     _UINT32_(2)                                          /* (PWM_OOV) Output Override Value for PWMH output of the channel 2 Position */
#define PWM_OOV_OOVH2_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVH2_Pos)                 /* (PWM_OOV) Output Override Value for PWMH output of the channel 2 Mask */
#define PWM_OOV_OOVH2(value)                  (PWM_OOV_OOVH2_Msk & (_UINT32_(value) << PWM_OOV_OOVH2_Pos)) /* Assigment of value for OOVH2 in the PWM_OOV register */
#define PWM_OOV_OOVL0_Pos                     _UINT32_(16)                                         /* (PWM_OOV) Output Override Value for PWML output of the channel 0 Position */
#define PWM_OOV_OOVL0_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVL0_Pos)                 /* (PWM_OOV) Output Override Value for PWML output of the channel 0 Mask */
#define PWM_OOV_OOVL0(value)                  (PWM_OOV_OOVL0_Msk & (_UINT32_(value) << PWM_OOV_OOVL0_Pos)) /* Assigment of value for OOVL0 in the PWM_OOV register */
#define PWM_OOV_OOVL1_Pos                     _UINT32_(17)                                         /* (PWM_OOV) Output Override Value for PWML output of the channel 1 Position */
#define PWM_OOV_OOVL1_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVL1_Pos)                 /* (PWM_OOV) Output Override Value for PWML output of the channel 1 Mask */
#define PWM_OOV_OOVL1(value)                  (PWM_OOV_OOVL1_Msk & (_UINT32_(value) << PWM_OOV_OOVL1_Pos)) /* Assigment of value for OOVL1 in the PWM_OOV register */
#define PWM_OOV_OOVL2_Pos                     _UINT32_(18)                                         /* (PWM_OOV) Output Override Value for PWML output of the channel 2 Position */
#define PWM_OOV_OOVL2_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVL2_Pos)                 /* (PWM_OOV) Output Override Value for PWML output of the channel 2 Mask */
#define PWM_OOV_OOVL2(value)                  (PWM_OOV_OOVL2_Msk & (_UINT32_(value) << PWM_OOV_OOVL2_Pos)) /* Assigment of value for OOVL2 in the PWM_OOV register */
#define PWM_OOV_Msk                           _UINT32_(0x00070007)                                 /* (PWM_OOV) Register Mask  */

#define PWM_OOV_OOVH_Pos                      _UINT32_(0)                                          /* (PWM_OOV Position) Output Override Value for PWMH output of the channel x */
#define PWM_OOV_OOVH_Msk                      (_UINT32_(0x7) << PWM_OOV_OOVH_Pos)                  /* (PWM_OOV Mask) OOVH */
#define PWM_OOV_OOVH(value)                   (PWM_OOV_OOVH_Msk & (_UINT32_(value) << PWM_OOV_OOVH_Pos)) 
#define PWM_OOV_OOVL_Pos                      _UINT32_(16)                                         /* (PWM_OOV Position) Output Override Value for PWML output of the channel 2 */
#define PWM_OOV_OOVL_Msk                      (_UINT32_(0x7) << PWM_OOV_OOVL_Pos)                  /* (PWM_OOV Mask) OOVL */
#define PWM_OOV_OOVL(value)                   (PWM_OOV_OOVL_Msk & (_UINT32_(value) << PWM_OOV_OOVL_Pos)) 

/* -------- PWM_OS : (PWM Offset: 0x48) (R/W 32) PWM Output Selection Register -------- */
#define PWM_OS_OSH0_Pos                       _UINT32_(0)                                          /* (PWM_OS) Output Selection for PWMH output of the channel 0 Position */
#define PWM_OS_OSH0_Msk                       (_UINT32_(0x1) << PWM_OS_OSH0_Pos)                   /* (PWM_OS) Output Selection for PWMH output of the channel 0 Mask */
#define PWM_OS_OSH0(value)                    (PWM_OS_OSH0_Msk & (_UINT32_(value) << PWM_OS_OSH0_Pos)) /* Assigment of value for OSH0 in the PWM_OS register */
#define PWM_OS_OSH1_Pos                       _UINT32_(1)                                          /* (PWM_OS) Output Selection for PWMH output of the channel 1 Position */
#define PWM_OS_OSH1_Msk                       (_UINT32_(0x1) << PWM_OS_OSH1_Pos)                   /* (PWM_OS) Output Selection for PWMH output of the channel 1 Mask */
#define PWM_OS_OSH1(value)                    (PWM_OS_OSH1_Msk & (_UINT32_(value) << PWM_OS_OSH1_Pos)) /* Assigment of value for OSH1 in the PWM_OS register */
#define PWM_OS_OSH2_Pos                       _UINT32_(2)                                          /* (PWM_OS) Output Selection for PWMH output of the channel 2 Position */
#define PWM_OS_OSH2_Msk                       (_UINT32_(0x1) << PWM_OS_OSH2_Pos)                   /* (PWM_OS) Output Selection for PWMH output of the channel 2 Mask */
#define PWM_OS_OSH2(value)                    (PWM_OS_OSH2_Msk & (_UINT32_(value) << PWM_OS_OSH2_Pos)) /* Assigment of value for OSH2 in the PWM_OS register */
#define PWM_OS_OSL0_Pos                       _UINT32_(16)                                         /* (PWM_OS) Output Selection for PWML output of the channel 0 Position */
#define PWM_OS_OSL0_Msk                       (_UINT32_(0x1) << PWM_OS_OSL0_Pos)                   /* (PWM_OS) Output Selection for PWML output of the channel 0 Mask */
#define PWM_OS_OSL0(value)                    (PWM_OS_OSL0_Msk & (_UINT32_(value) << PWM_OS_OSL0_Pos)) /* Assigment of value for OSL0 in the PWM_OS register */
#define PWM_OS_OSL1_Pos                       _UINT32_(17)                                         /* (PWM_OS) Output Selection for PWML output of the channel 1 Position */
#define PWM_OS_OSL1_Msk                       (_UINT32_(0x1) << PWM_OS_OSL1_Pos)                   /* (PWM_OS) Output Selection for PWML output of the channel 1 Mask */
#define PWM_OS_OSL1(value)                    (PWM_OS_OSL1_Msk & (_UINT32_(value) << PWM_OS_OSL1_Pos)) /* Assigment of value for OSL1 in the PWM_OS register */
#define PWM_OS_OSL2_Pos                       _UINT32_(18)                                         /* (PWM_OS) Output Selection for PWML output of the channel 2 Position */
#define PWM_OS_OSL2_Msk                       (_UINT32_(0x1) << PWM_OS_OSL2_Pos)                   /* (PWM_OS) Output Selection for PWML output of the channel 2 Mask */
#define PWM_OS_OSL2(value)                    (PWM_OS_OSL2_Msk & (_UINT32_(value) << PWM_OS_OSL2_Pos)) /* Assigment of value for OSL2 in the PWM_OS register */
#define PWM_OS_Msk                            _UINT32_(0x00070007)                                 /* (PWM_OS) Register Mask  */

#define PWM_OS_OSH_Pos                        _UINT32_(0)                                          /* (PWM_OS Position) Output Selection for PWMH output of the channel x */
#define PWM_OS_OSH_Msk                        (_UINT32_(0x7) << PWM_OS_OSH_Pos)                    /* (PWM_OS Mask) OSH */
#define PWM_OS_OSH(value)                     (PWM_OS_OSH_Msk & (_UINT32_(value) << PWM_OS_OSH_Pos)) 
#define PWM_OS_OSL_Pos                        _UINT32_(16)                                         /* (PWM_OS Position) Output Selection for PWML output of the channel 2 */
#define PWM_OS_OSL_Msk                        (_UINT32_(0x7) << PWM_OS_OSL_Pos)                    /* (PWM_OS Mask) OSL */
#define PWM_OS_OSL(value)                     (PWM_OS_OSL_Msk & (_UINT32_(value) << PWM_OS_OSL_Pos)) 

/* -------- PWM_OSS : (PWM Offset: 0x4C) ( /W 32) PWM Output Selection Set Register -------- */
#define PWM_OSS_OSSH0_Pos                     _UINT32_(0)                                          /* (PWM_OSS) Output Selection Set for PWMH output of the channel 0 Position */
#define PWM_OSS_OSSH0_Msk                     (_UINT32_(0x1) << PWM_OSS_OSSH0_Pos)                 /* (PWM_OSS) Output Selection Set for PWMH output of the channel 0 Mask */
#define PWM_OSS_OSSH0(value)                  (PWM_OSS_OSSH0_Msk & (_UINT32_(value) << PWM_OSS_OSSH0_Pos)) /* Assigment of value for OSSH0 in the PWM_OSS register */
#define PWM_OSS_OSSH1_Pos                     _UINT32_(1)                                          /* (PWM_OSS) Output Selection Set for PWMH output of the channel 1 Position */
#define PWM_OSS_OSSH1_Msk                     (_UINT32_(0x1) << PWM_OSS_OSSH1_Pos)                 /* (PWM_OSS) Output Selection Set for PWMH output of the channel 1 Mask */
#define PWM_OSS_OSSH1(value)                  (PWM_OSS_OSSH1_Msk & (_UINT32_(value) << PWM_OSS_OSSH1_Pos)) /* Assigment of value for OSSH1 in the PWM_OSS register */
#define PWM_OSS_OSSH2_Pos                     _UINT32_(2)                                          /* (PWM_OSS) Output Selection Set for PWMH output of the channel 2 Position */
#define PWM_OSS_OSSH2_Msk                     (_UINT32_(0x1) << PWM_OSS_OSSH2_Pos)                 /* (PWM_OSS) Output Selection Set for PWMH output of the channel 2 Mask */
#define PWM_OSS_OSSH2(value)                  (PWM_OSS_OSSH2_Msk & (_UINT32_(value) << PWM_OSS_OSSH2_Pos)) /* Assigment of value for OSSH2 in the PWM_OSS register */
#define PWM_OSS_OSSL0_Pos                     _UINT32_(16)                                         /* (PWM_OSS) Output Selection Set for PWML output of the channel 0 Position */
#define PWM_OSS_OSSL0_Msk                     (_UINT32_(0x1) << PWM_OSS_OSSL0_Pos)                 /* (PWM_OSS) Output Selection Set for PWML output of the channel 0 Mask */
#define PWM_OSS_OSSL0(value)                  (PWM_OSS_OSSL0_Msk & (_UINT32_(value) << PWM_OSS_OSSL0_Pos)) /* Assigment of value for OSSL0 in the PWM_OSS register */
#define PWM_OSS_OSSL1_Pos                     _UINT32_(17)                                         /* (PWM_OSS) Output Selection Set for PWML output of the channel 1 Position */
#define PWM_OSS_OSSL1_Msk                     (_UINT32_(0x1) << PWM_OSS_OSSL1_Pos)                 /* (PWM_OSS) Output Selection Set for PWML output of the channel 1 Mask */
#define PWM_OSS_OSSL1(value)                  (PWM_OSS_OSSL1_Msk & (_UINT32_(value) << PWM_OSS_OSSL1_Pos)) /* Assigment of value for OSSL1 in the PWM_OSS register */
#define PWM_OSS_OSSL2_Pos                     _UINT32_(18)                                         /* (PWM_OSS) Output Selection Set for PWML output of the channel 2 Position */
#define PWM_OSS_OSSL2_Msk                     (_UINT32_(0x1) << PWM_OSS_OSSL2_Pos)                 /* (PWM_OSS) Output Selection Set for PWML output of the channel 2 Mask */
#define PWM_OSS_OSSL2(value)                  (PWM_OSS_OSSL2_Msk & (_UINT32_(value) << PWM_OSS_OSSL2_Pos)) /* Assigment of value for OSSL2 in the PWM_OSS register */
#define PWM_OSS_Msk                           _UINT32_(0x00070007)                                 /* (PWM_OSS) Register Mask  */

#define PWM_OSS_OSSH_Pos                      _UINT32_(0)                                          /* (PWM_OSS Position) Output Selection Set for PWMH output of the channel x */
#define PWM_OSS_OSSH_Msk                      (_UINT32_(0x7) << PWM_OSS_OSSH_Pos)                  /* (PWM_OSS Mask) OSSH */
#define PWM_OSS_OSSH(value)                   (PWM_OSS_OSSH_Msk & (_UINT32_(value) << PWM_OSS_OSSH_Pos)) 
#define PWM_OSS_OSSL_Pos                      _UINT32_(16)                                         /* (PWM_OSS Position) Output Selection Set for PWML output of the channel 2 */
#define PWM_OSS_OSSL_Msk                      (_UINT32_(0x7) << PWM_OSS_OSSL_Pos)                  /* (PWM_OSS Mask) OSSL */
#define PWM_OSS_OSSL(value)                   (PWM_OSS_OSSL_Msk & (_UINT32_(value) << PWM_OSS_OSSL_Pos)) 

/* -------- PWM_OSC : (PWM Offset: 0x50) ( /W 32) PWM Output Selection Clear Register -------- */
#define PWM_OSC_OSCH0_Pos                     _UINT32_(0)                                          /* (PWM_OSC) Output Selection Clear for PWMH output of the channel 0 Position */
#define PWM_OSC_OSCH0_Msk                     (_UINT32_(0x1) << PWM_OSC_OSCH0_Pos)                 /* (PWM_OSC) Output Selection Clear for PWMH output of the channel 0 Mask */
#define PWM_OSC_OSCH0(value)                  (PWM_OSC_OSCH0_Msk & (_UINT32_(value) << PWM_OSC_OSCH0_Pos)) /* Assigment of value for OSCH0 in the PWM_OSC register */
#define PWM_OSC_OSCH1_Pos                     _UINT32_(1)                                          /* (PWM_OSC) Output Selection Clear for PWMH output of the channel 1 Position */
#define PWM_OSC_OSCH1_Msk                     (_UINT32_(0x1) << PWM_OSC_OSCH1_Pos)                 /* (PWM_OSC) Output Selection Clear for PWMH output of the channel 1 Mask */
#define PWM_OSC_OSCH1(value)                  (PWM_OSC_OSCH1_Msk & (_UINT32_(value) << PWM_OSC_OSCH1_Pos)) /* Assigment of value for OSCH1 in the PWM_OSC register */
#define PWM_OSC_OSCH2_Pos                     _UINT32_(2)                                          /* (PWM_OSC) Output Selection Clear for PWMH output of the channel 2 Position */
#define PWM_OSC_OSCH2_Msk                     (_UINT32_(0x1) << PWM_OSC_OSCH2_Pos)                 /* (PWM_OSC) Output Selection Clear for PWMH output of the channel 2 Mask */
#define PWM_OSC_OSCH2(value)                  (PWM_OSC_OSCH2_Msk & (_UINT32_(value) << PWM_OSC_OSCH2_Pos)) /* Assigment of value for OSCH2 in the PWM_OSC register */
#define PWM_OSC_OSCL0_Pos                     _UINT32_(16)                                         /* (PWM_OSC) Output Selection Clear for PWML output of the channel 0 Position */
#define PWM_OSC_OSCL0_Msk                     (_UINT32_(0x1) << PWM_OSC_OSCL0_Pos)                 /* (PWM_OSC) Output Selection Clear for PWML output of the channel 0 Mask */
#define PWM_OSC_OSCL0(value)                  (PWM_OSC_OSCL0_Msk & (_UINT32_(value) << PWM_OSC_OSCL0_Pos)) /* Assigment of value for OSCL0 in the PWM_OSC register */
#define PWM_OSC_OSCL1_Pos                     _UINT32_(17)                                         /* (PWM_OSC) Output Selection Clear for PWML output of the channel 1 Position */
#define PWM_OSC_OSCL1_Msk                     (_UINT32_(0x1) << PWM_OSC_OSCL1_Pos)                 /* (PWM_OSC) Output Selection Clear for PWML output of the channel 1 Mask */
#define PWM_OSC_OSCL1(value)                  (PWM_OSC_OSCL1_Msk & (_UINT32_(value) << PWM_OSC_OSCL1_Pos)) /* Assigment of value for OSCL1 in the PWM_OSC register */
#define PWM_OSC_OSCL2_Pos                     _UINT32_(18)                                         /* (PWM_OSC) Output Selection Clear for PWML output of the channel 2 Position */
#define PWM_OSC_OSCL2_Msk                     (_UINT32_(0x1) << PWM_OSC_OSCL2_Pos)                 /* (PWM_OSC) Output Selection Clear for PWML output of the channel 2 Mask */
#define PWM_OSC_OSCL2(value)                  (PWM_OSC_OSCL2_Msk & (_UINT32_(value) << PWM_OSC_OSCL2_Pos)) /* Assigment of value for OSCL2 in the PWM_OSC register */
#define PWM_OSC_Msk                           _UINT32_(0x00070007)                                 /* (PWM_OSC) Register Mask  */

#define PWM_OSC_OSCH_Pos                      _UINT32_(0)                                          /* (PWM_OSC Position) Output Selection Clear for PWMH output of the channel x */
#define PWM_OSC_OSCH_Msk                      (_UINT32_(0x7) << PWM_OSC_OSCH_Pos)                  /* (PWM_OSC Mask) OSCH */
#define PWM_OSC_OSCH(value)                   (PWM_OSC_OSCH_Msk & (_UINT32_(value) << PWM_OSC_OSCH_Pos)) 
#define PWM_OSC_OSCL_Pos                      _UINT32_(16)                                         /* (PWM_OSC Position) Output Selection Clear for PWML output of the channel 2 */
#define PWM_OSC_OSCL_Msk                      (_UINT32_(0x7) << PWM_OSC_OSCL_Pos)                  /* (PWM_OSC Mask) OSCL */
#define PWM_OSC_OSCL(value)                   (PWM_OSC_OSCL_Msk & (_UINT32_(value) << PWM_OSC_OSCL_Pos)) 

/* -------- PWM_OSSUPD : (PWM Offset: 0x54) ( /W 32) PWM Output Selection Set Update Register -------- */
#define PWM_OSSUPD_OSSUPH0_Pos                _UINT32_(0)                                          /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 0 Position */
#define PWM_OSSUPD_OSSUPH0_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPH0_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 0 Mask */
#define PWM_OSSUPD_OSSUPH0(value)             (PWM_OSSUPD_OSSUPH0_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPH0_Pos)) /* Assigment of value for OSSUPH0 in the PWM_OSSUPD register */
#define PWM_OSSUPD_OSSUPH1_Pos                _UINT32_(1)                                          /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 1 Position */
#define PWM_OSSUPD_OSSUPH1_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPH1_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 1 Mask */
#define PWM_OSSUPD_OSSUPH1(value)             (PWM_OSSUPD_OSSUPH1_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPH1_Pos)) /* Assigment of value for OSSUPH1 in the PWM_OSSUPD register */
#define PWM_OSSUPD_OSSUPH2_Pos                _UINT32_(2)                                          /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 2 Position */
#define PWM_OSSUPD_OSSUPH2_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPH2_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 2 Mask */
#define PWM_OSSUPD_OSSUPH2(value)             (PWM_OSSUPD_OSSUPH2_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPH2_Pos)) /* Assigment of value for OSSUPH2 in the PWM_OSSUPD register */
#define PWM_OSSUPD_OSSUPL0_Pos                _UINT32_(16)                                         /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 0 Position */
#define PWM_OSSUPD_OSSUPL0_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPL0_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 0 Mask */
#define PWM_OSSUPD_OSSUPL0(value)             (PWM_OSSUPD_OSSUPL0_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPL0_Pos)) /* Assigment of value for OSSUPL0 in the PWM_OSSUPD register */
#define PWM_OSSUPD_OSSUPL1_Pos                _UINT32_(17)                                         /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 1 Position */
#define PWM_OSSUPD_OSSUPL1_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPL1_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 1 Mask */
#define PWM_OSSUPD_OSSUPL1(value)             (PWM_OSSUPD_OSSUPL1_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPL1_Pos)) /* Assigment of value for OSSUPL1 in the PWM_OSSUPD register */
#define PWM_OSSUPD_OSSUPL2_Pos                _UINT32_(18)                                         /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 2 Position */
#define PWM_OSSUPD_OSSUPL2_Msk                (_UINT32_(0x1) << PWM_OSSUPD_OSSUPL2_Pos)            /* (PWM_OSSUPD) Output Selection Set for PWML output of the channel 2 Mask */
#define PWM_OSSUPD_OSSUPL2(value)             (PWM_OSSUPD_OSSUPL2_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPL2_Pos)) /* Assigment of value for OSSUPL2 in the PWM_OSSUPD register */
#define PWM_OSSUPD_Msk                        _UINT32_(0x00070007)                                 /* (PWM_OSSUPD) Register Mask  */

#define PWM_OSSUPD_OSSUPH_Pos                 _UINT32_(0)                                          /* (PWM_OSSUPD Position) Output Selection Set for PWMH output of the channel x */
#define PWM_OSSUPD_OSSUPH_Msk                 (_UINT32_(0x7) << PWM_OSSUPD_OSSUPH_Pos)             /* (PWM_OSSUPD Mask) OSSUPH */
#define PWM_OSSUPD_OSSUPH(value)              (PWM_OSSUPD_OSSUPH_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPH_Pos)) 
#define PWM_OSSUPD_OSSUPL_Pos                 _UINT32_(16)                                         /* (PWM_OSSUPD Position) Output Selection Set for PWML output of the channel 2 */
#define PWM_OSSUPD_OSSUPL_Msk                 (_UINT32_(0x7) << PWM_OSSUPD_OSSUPL_Pos)             /* (PWM_OSSUPD Mask) OSSUPL */
#define PWM_OSSUPD_OSSUPL(value)              (PWM_OSSUPD_OSSUPL_Msk & (_UINT32_(value) << PWM_OSSUPD_OSSUPL_Pos)) 

